[{
    "skill": [{
        "title": "Polymer",
        "description": "Not Chemical. It's a Web Components library developed by Google"
    }, {
        "title": "Firebase",
        "description": "Better than Parse. Real-time Cloud Database by Google"
    }, {
        "title": "HTML/CSS/JS",
        "description": "The Fundemental for Web Development. Flowerpot anyone?"
    }, {
        "title": "Python",
        "description": "Technically you can import almost everything, except donald trump"
    }, {
        "title": "Web Design",
        "description": "Website without design. What? Are you still living in 1995?"
    }, {
        "title": "Eat/Sleep/Travel",
        "description": "Programmers are human too. We need sleep and food, pizza mostly. Or maybe no"
    }, {
        "title": "Piano",
        "description": "ABRSM Grade 8. Hate 20th-century music. "
    }, {
        "title": "Design and Editing",
        "description": "Love Photoshop. I designed my own profile picture, took me around 5 hours, and it's called 'Polygon effect'. Make YouTube video sometimes"
    }, {
        "title": "Event Organizer/Speaker",
        "description": "Currently a committee for Google Developer Group Kuala Lumpur. Love to organize Googley events."
    }],
    "research": [{
        "title": "Web Components/Polymer",
        "description": "I love Polymer so much. Almost all my web-based projects are using Polymer. Paper elements, iron elements, platinum elements, neon elements..."
    }, {
        "title": "Material Design",
        "description": "Material Design is awesome. It looks so nice on the screen. Clean, simple, beautiful. Everyone loves Material Design right? (especially Duarte)"
    }, {
        "title": "Progressive Web App",
        "description": "Native or Web? PWA works offline, and most important it looks like native app. I am a web guy, I prefer PWA."
    }, {
        "title": "Front-End Web Development",
        "description": "Back-end is complex(?). Front-end is simple (but not that simple) but still powerful. Love front-end web dev so much"
    }, {
        "title": "Android Development",
        "description": "Although I love Web so much, I still make (and learn) Android development sometimes. Not always."
    }]
}]
