{
    "header": "解碼通關",
    "id": "firebass-challenge-google-io-oriental-daily",
    "date": "April 5, 2017",
    "publisher": "Oriental Daily 東方日報",
    "author": "郑宇晴",
    "link": "http://www.orientaldaily.com.my/s/191483",
    "post": "![](https://res.cloudinary.com/limhenry/image/upload/v1524738843/limhenryxyz/od.jpg) \n\n 谷歌网络开发者年会（Google I/O）是许多科技开发者嚮往的年度科技大会，但门票往往在开卖的短时间內便售罄，使许多开发者大感遗憾。为了发掘更多编码人才，谷歌趁著去年的网络开发者年会隱晦地发起一场编码挑战，首100名成功破解的人可获得2017年谷歌大会门票一张，而其中一名得奖者便是来自大马的电脑科学系学生。 \n\n 以另类实境游戏（Alternate Reality Game）方式进行的「Google Firebass Challenge」，预设了连串的挑战及谜题，玩家需要在现实生活中寻找提示，才能完成任务。「这整个过程没什么逻辑可言，任何东西都可能出现。」作为首100名成功破解「Google Firebass Challenge」的得奖者之一，21岁的林亨力笑谈完成挑战的感想。 \n\n 身为一名电脑科学系学生，林亨力与其他科技开发者一样，非常关注谷歌网络开发者年会（Google I/O）。透过去年的谷歌网络开发者年会，他意外发现谷歌开发者在推特（Twitter）上发佈的隱晦参赛文：「想要贏取2017年谷歌网络开发者年会的入门票吗？到Firebase.foo玩，便有贏取门票的机会。」他隨即在网络上看到一些「奇怪」提示——有人在展场的桌上发现一张与Firebase.foo有关的字条、展场上出现了一幅以鱼为主题的扑克牌等。种种现象让他心生好奇，於是他在这个网站上展开了一系列的「调查」。 \n\n「瀏览这个网站时，我一直觉得很奇怪，因为这个网站跟原本的『Firebase』长得很相似，却又有不同之处。」他指出，网页中的人物图像都变成人鱼图像，而標语等也出现小差异。於是，他在这网站上费了一番工夫，才在网页中找到进入比赛的关键提示。「由於这个是一个编码游戏，所以参赛者必须具备编码能力，否则即便找到进入比赛的提示，也无法再进一步完成。」 \n\n「Firebass」与谷歌科技產品「Firebase」谐音，乃以「Firebase」为背景，衍生出另一个隱藏游戏提示模擬网站。玩家若对「Firebase」有所了解，便能更快地掌握原版与游戏版网页展示的差別。 \n\n ![](http://media.orientaldaily.com.my/images/made/images/remote/http_media.orientaldaily.com.my/images/uploads/news/2017/APR_2017/20170405/4C_20170331HXLD05_700_467.jpg)*林亨力喜欢尝试前端网页开发，课余也兼职为不少公司设立网站。未来，他希望可以转攻后端网页开发，以瞭解更多网页开发的技术。* \n\n ## 线索无所不在，时刻启动「解码模式」\n\n 由於谷歌没有在官方网站作正式宣佈，所有参赛消息都是社交媒体上的「道听途说」，让林亨力不断质疑赛事的真实性。「从开始到结束，我都在怀疑这到底会不会是一场骗局，因为这游戏实在太奇怪了。」 \n\n 赛事被分为3个阶段，每个阶段都设有需要破解的「密码」，而答案类型非常广泛，除了编码知识，也涵盖摩斯密码、旗语（Flag Semaphore）、光谱图等。「最大的挑战应该就是破解这些不按理出牌的『密码』吧！我每天都在电脑前花上五六个小时解码。」他笑说，由於赛事初期已经遇过许多不合乎常理或藏得非常隱秘的提示，让他每每看到任何类似「线索」的东西都会疑神疑鬼，跃跃欲试，想要破解。 \n\n 最教林亨力印象深刻的是关卡与关卡之间设有时间锁（Timelock），一旦通关，需要等到两天后才能开启下一关。经歷过曲折的解码过程后，他不相信真的需要等待两天，於是极力寻求破解方式。「我在网上问了许多人，后来召集了一群玩家一起尝试破解。最后我们还是失败了，因为官方设置確实是必须等待两天。」他调侃自己「不信邪」，闯关至第三阶段时，仍认定会有其他破解方式，费了一番功夫，同样发现需要按照时间锁的倒数计时等待数天，才能开启新关卡。 \n\n「最刺激的是，我居然卡在完成赛事的最后一个步骤——下载某个软体。」完成赛事需要下载某个软体，並输入解码密码，但林亨力的电脑无法支持安卓系统，导致下载失败。「那时候，我既紧张又害怕，担心自己即便闯关成功也无法索取入门票。因为在我还在尝试安装软体时，就已经有人在社交媒体上宣佈已经成功闯关了。」情急之下，他抢过友人的笔记型电脑，直接下载软体，完成最后步骤。 \n\n 最终，林亨力以第51的名次完成赛事，成为全球首100名完成挑战的贏家，获得2017年谷歌网络开发者年会的入门票。「我最期待的，便是届时与那些科技开发者见面、交流。」\n\n ![](http://media.orientaldaily.com.my/images/made/images/remote/http_media.orientaldaily.com.my/images/uploads/news/2017/APR_2017/20170405/4c_005_700_467.jpg)*出席谷歌网络开发者年会「朝圣」成了林亨力积极闯关，完成挑战的最大动力。* \n\n ## 善用专业　兼职设立网页 \n\n 出席谷歌网络开发者年会一直是林亨力的梦想，但今年才21岁的他未曾想过自己能在这一年，为自己贏来一份最好的「成年礼物」。他指出，一张门票要价约5000令吉，加上今年开卖一分钟就宣告售罄，由此可见科技开发者对於此年会的热衷程度。然而，谷歌仅送出门票，其他费用需由得奖者自己承担，还是学生的林亨力笑称，「没问题！」原来，他善用自己的专业，兼职为好些公司设立网站，从中赚取旅费。「算是边学边做吧。」他坦言，只要运用他现有的科技知识，边学边做，就能赚取一些额外的零用钱，无需给家里增添经济负担。「当然，我也找到一些赞助，所以此行到加利福尼亚並没有资金上的问题。」\n\n 林亨力指出，他最希望可以和自己的偶像——知名网页开发者积克阿奇巴尔德（Jake Archibald）及保罗肯兰（Paul Kinlan）会面。「若可以有机会跟他们交流，那就更棒了。」他目前专注前端网页开发（Front-End Web Development），期望未来可以追隨两位偶像的步伐，成为网页开发的佼佼者。\n\n ![](http://media.orientaldaily.com.my/images/made/images/remote/http_media.orientaldaily.com.my/images/uploads/news/2017/APR_2017/20170405/4C_20170331HXLD15_700_467.jpg)*仄菲里认为，林亨力可以成为眾科技人的榜样，鼓励更多人投身科技领域。* \n\n ## 比赛招募编码人才 \n\n「科技开发领域中，有许多人才都是通过各种赛事招揽回来的，因为这是他们展现才能的最好方式。这一次大马人可以在这项挑战中贏得一席之位，我们深感荣幸。」马来西亚谷歌通讯与公共事务总监仄菲里（Zeffri Yusof）表示，以往的赛事中鲜少出现大马得奖者，此次获奖可作为其他大马科技开发者的榜样。「我们希望可以以此为鉴，鼓励更多年轻人往这方面（科技界）发展。」\n\n 这是谷歌第一次推行上述赛事，也是首次送出谷歌网络开发者年会的入门票。「我们也有其他比赛，尤其是骇客大赛，但一般都是送出奖金。」仄菲里笑说，谷歌网络开发者年会是许多科技开发者梦寐以求的「朝圣」活动，因此，以入门票为奖励除了可以鼓励更多人参与，也让有才能的科技人一尝所愿。「Firebase」可以帮助人们在没有专业知识的情况下进行各种尝试，他补充，「这个平台尤其適合像林亨力这类型的人才，从小就对电脑、编码感兴趣，在中学时期便开始尝试编码的一群。」"
}