{
    "header": "I am now a Google Developer Expert in Web Technologies!",
    "id": "i-am-now-a-google-developer-expert-in-web-technologies",
    "date": "April 9, 2018",
    "publisher": "Medium",
    "author": "Henry Lim",
    "link": "https://medium.com/@limhenry/i-am-now-a-google-developer-expert-in-web-technologies-64be25c29812",
    "post": "![](https://cdn-images-1.medium.com/max/2000/1*YYY6UAMXatz2DCdnxsa5PA.jpeg) \n\n I am now a Google Developer Expert in Web Technologies! It’s official. I am now a Google Developer Expert in Web Technologies. 🎉 \n\n # What is Google Developers Experts? \n\n > Google Developers Experts (GDEs) are a global network of experienced product strategists, designers, developers, and marketing professionals actively supporting developers, startups, and companies changing the world through web and mobile applications. \n\n # How do I become a Google Developer Expert? \n\n I joined Google Developer Group Kuala Lumpur in October 2015 as a volunteer and became the community co-organizer a few months later. During that time, I met a lot of awesome developers, Google Developer Experts, and Googlers during the GDG events. That was the time I learned about the GDE program. \n\n At the same time, I started to learn and use a few Google technologies including Polymer, Progressive Web Apps, and Firebase. On December 2015, I gave my very first talk: “The Future of Web Dev: Polymer and Firebase”. \n\n ![](https://cdn-images-1.medium.com/max/800/1*C1nNt9Um2jZXJPiGeywXgw.png)*My first tech talk @ Barcamp Cyberjaya 2015* \n\n That was my first step, and that was the moment I realized sharing my knowledge with other people is actually a very fun thing to do! At the same time, I also started to develop some cool side-projects like Remote for Slides and I/O Extended ’17 Kuala Lumpur PWA. \n\n ![](https://cdn-images-1.medium.com/max/1600/1*OgQTGKsWkEs81DMrKqKYkw.jpeg)*Tech Talk Thursday with Google and GDGKL — Polymer and Progressive Web Apps* \n\n My original plan is to apply to become a Google Developer Expert two to three years after I completed my Computer Science degree course. However, nothing goes according to plan. (For example, I planned to attend Google I/O after I started working, but I did that in my second year at university. 😑)\n\n Anyway, I met a lot GDEs on social networks, and some of them occasionally ask me why I didn’t try to apply to become a GDE. However, I personally think that I am lack of experience, so I refused them.\n\n After a few months, a Googler from Developer Relations Program suggested to send my portfolio to him, and he will check for me if I met the criteria to become a GDE.\n\n *Satya Kresna Adi Pratama is a web developer from Indonesia.* \n\n *Toni-Jan Keith Monserrat is a GDE in Web Technologies from the Philippines.* \n\n A few days later, I got the green light from the Googler, and I started the GDE application process. The interviews were fun, and I learned a lot during that time. If you want to learn more about how you can become one of the Google Developers Experts and the application process, here’s an awesome article by Aaron Frost:\n\n # SPAM! \n\n ![](https://cdn-images-1.medium.com/max/1000/1*9WruKdtz1pcy0fxL2toJng.jpeg)*SPAMs in the Target’s shopping cart.* If you passed the interview process, the system will automatically send you an email. However, I received nothing, until one of the GDE messaged me this: \n\n ![](https://cdn-images-1.medium.com/max/800/1*OmkrtauYK9XwOl0ocMWeHw.png) \n\n That was the moment I realized something is wrong since I didn’t receive any email. Either that’s was a system error, or … \n\n ![](https://cdn-images-1.medium.com/max/1400/1*XpvsPflkJlY8GAFbygqBLQ.png) \n\n Ta-da! I found the email in the spam folder! Thanks to Google’s awesome spam filter, I only discovered that 16 hours later. Anyway, I am still extremely happy the moment I saw the email, I passed the interview! (Is this real?) \n\n ![](https://i.embed.ly/1/image?url=https%3A%2F%2Fmedia1.giphy.com%2Fmedia%2FMhHXeM4SpKrpC%2Fgiphy.gif&key=4fce0568f2ce49e8b54624ef71a8a5bd)*I am now a Google Developer Expert!* \n\n # What’s next? \n\n For the next few months, I will continue teaching students web development at The One Academy. At the same time, I hope I can share my knowledge with more developers in this region. \n\n\n\n Thanks Robert Nyman, Horacio Gonzalez, Thomas Steiner, Jecelyn Yeen, Jirawatee, Bok Thye Yeow and Chelle Obligacion-Gray for the guidance and support! \n\n 🌏 中文版/Chinese Version : https://goo.gl/Z9Ng6z"
}