{
    "header": "Student nets elusive Firebass for ticket to Google’s I/O 2017",
    "id": "student-nets-elusive-firebass-ticket-googles-io-2017",
    "date": "March 21, 2017",
    "publisher": "Digital News Asia",
    "author": "Chong Jinn Xiung",
    "link": "https://www.digitalnewsasia.com/mobility/student-nets-elusive-firebass-ticket-google%E2%80%99s-io-2017",
    "post": "![](https://www.digitalnewsasia.com/sites/default/files/images/Computer%20science%20student%20Henry%20Lim.jpg) \n\n TO THE untrained eye, https://firebase.foo may appear to be a simple website that has a strange obsession with a certain fish by the name of Firebass. \n\n But cleverly hidden underneath its unassuming exterior is a game that invites players to find the elusive Firebass that a Firebase employee has accidentally lost. Keen-eyed front-end web developer Henry Lim (pic) realised that something was amiss about the website and that led him to the Firebass ARG Challenge, a hidden game that resides within a variety of static web pages dotted with tricky puzzles created by Google’s Firebase team. \n\n Firebase is a mobile platform that permits web developers the ability to easily make web applications with no server-side programming. Simply put, it simplifies the process of developing apps for the web, iOS and Android.\n\n The challenge was subtly issued during last year’s Google I/O conference with the objective of teaching web developers about the new version of Firebase and reward those who complete the challenge with a free ticket to I/O 2017. \n\n Lim is in fact, one of the few Asians that make up the 100 winners of the challenge who will be going to Google’s Mountain View campus in California this May. \n\n Solving the challenge was not easy but Lim’s inquisitive nature to learn how things work helped him persevere and ultimately solve the mysterious game. \n\n “To be honest this is the first time that I have played an ARG. I’m not even a gamer myself but I found the challenge to be fun as I would continuously try to solve the problems until I found the next clue,” said the 21-year-old second-year computer science student. \n\n There were moments when Lim literally had no idea what he was doing but he then realised that he needed to work together with his other coder friends from around the world to uncover clues left by the slippery Firebass. \n\n The irony of a challenge that requires participants to sit in front of a computer to solve clues is that it has actually made Lim realise that no man is an island. \n\n “You have to be brave to go out to interact and meet new people. It made me realise that working in a development team means that interpersonal skills are an important trait,” he said. \n\n In many ways, that is in fact, the quality that Google looks for in its employees, fondly known internally as Googlers. \n\n Although Lim had a late start as a coder, having only been introduced to coding when he was in his college foundation year, he is in agreement that the Malaysian government’s recent efforts to encourage coding in schools is a step in the right direction. \n\n “Back in school I had no idea of what HTML, Javascript or CSS was but once you get a basic understanding of its algorithms it can actually be fun,” Lim said. \n\n With his ticket secured, Lim has waited almost a year for his trip to Mountain View and is brimming with excitement. \n\n “I look forward to my time at I/O and hope to attend the keynotes and other tracks during the conference. But most importantly I want to network with the expert developers and learn as much as I can while I am there,” he said. \n\n As a hardcore web developer, Lim said he is looking forward to the announcements at I/O 2017 on latest developments for the Chrome browser and of course Firebase after having learned about it through the ARG."
}