{
    "header": "Why I love Firebase (and what is Firebase) ❤️🔥",
    "id": "why-i-love-firebase-and-what-is-firebase",
    "date": "August 15, 2017",
    "author": "Henry Lim",
    "publisher": "Medium",
    "link": "https://medium.com/@limhenry/why-i-love-firebase-and-what-is-firebase-%EF%B8%8F-96b54509d450",
    "post": "![](https://cdn-images-1.medium.com/max/1000/1*T-3-yWimMuCa0DG7ZTKPJw.jpeg)*Firebase AppShip3000 @ Google I/O 2017* \n\n Firebase (/ˈfī(ə)rˌbās/), Firebase gives developers the tools to develop high-quality apps, grow your user base, and earn more money. Firebase covers the essentials so developer can monetize their business and focus on the users. \n\n # Firebase Products/Services \n\n TL;DR: Firebase consists of 2 big services — “Develop & test your app” and “Grow & engage your audience”. \n\n ## Develop & test your app \n\n [Realtime Database](https://firebase.google.com/products/database) - Store and sync app data in milliseconds ❤️ \n\n [Authentication](https://firebase.google.com/products/auth/) - Authenticate users simply and securely ❤️ \n\n [Cloud Functions](https://firebase.google.com/products/functions/) - Run mobile backend code without managing servers ❤️ \n\n [Cloud Storage](https://firebase.google.com/products/storage/) - Store and serve files at Google scale ❤️ \n\n [Hosting](https://firebase.google.com/products/hosting) - Deliver web app assets with speed and security ❤️ \n\n [Crash Reporting](https://firebase.google.com/products/crash/) - Find and prioritize bugs; fix them faster \n\n [Test Lab for Android](https://firebase.google.com/products/test-lab/) - Test your app on devices hosted by Google \n\n [Performance Monitoring](https://firebase.google.com/products/performance/) - Gain insight into your app’s performance \n\n ## Grow & engage your audience \n\n [Cloud Messaging](https://firebase.google.com/products/cloud-messaging/) - Send targeted messages and notifications ❤️ \n\n [Google Analytics](https://firebase.google.com/products/analytics/) - Get free and unlimited app analytics \n\n [Dynamic Links](https://firebase.google.com/products/dynamic-links/) - Drive growth by using deep links with attribution \n\n [Remote Config](https://firebase.google.com/products/remote-config/) - Modify your app without deploying a new version \n\n [Invites](https://firebase.google.com/docs/invites/) - Make it easy to share your app and content \n\n [App Indexing](https://firebase.google.com/products/app-indexing/) - Drive search traffic to your mobile app \n\n [AdMob](https://firebase.google.com/docs/admob/) - Maximize revenue with in-app ads \n\n [AdWords](https://firebase.google.com/docs/adwords/) - Drive installs with targeted ad campaigns \n\n # Features/Products/Services that I ❤️  \n\n Since I am a **front-end web developer**, there are some Firebase features that are completely useless for me (For example, Firebase Remote Config, which is only available on Android, iOS, C++ and Unity). However, there are still a lot Firebase’s features that really make my life easier. \n\n ## Cloud Functions for Firebase \n\n This is my favorite Firebase feature. Cloud Functions for Firebase lets you automatically run backend code in response to events triggered by Firebase features and HTTPS requests. You even can Node.js framework like Express on Cloud Functions! Super cool! \n\n Also, this is one of the easiest methods to run your Node.js code on the cloud (and without paying anything ehem 😛) \n\n ## Firebase Realtime Database \n\n Obviously, this is the biggest features on Fire**BASE**. Firebase Realtime Database is a noSQL database that lets you store and sync data between your users in realtime. Everything inside the database is JSON objects, so there are no tables or records. But always remember, always avoid nesting data, keep your data structure as flat as possible. #perfmatters \n\n Also, you can [create a Real Time Chat Web App](https://codelabs.developers.google.com/codelabs/cloud-firebase-chat/) using Firebase Realtime Database in no time! \n\n ## Firebase Hosting \n\n Firebase Hosting allows you to deploy and serve your web apps and static content to a super fast global CDN. By using Firebase CLI, you can deploy web app just using one command and it will be running in few seconds. Also, you get SSL and HTTP/2 + HTTP/2 Server Push for free. Most importantly, Firebase will setup everything for you. Super awesome! \n\n ## Cloud Storage for Firebase \n\n Basically Cloud Storage is similar to AWS S3. For developer, Cloud Storage is simple to use and it has high scalability. For user, it’s fast, safe and secure. In fact, Spotify is currently running on Google Cloud Platform and using Cloud Storage to store all the songs. So you can know how powerful is Cloud Storage. \n\n Of course, Cloud Storage is built to store and serve content like photos or videos. For HTML, CSS and JavaScript files, you should store and host it on Firebase Hosting. And use Firebase Realtime Database to store JSON data, like chat messages. \n\n ## Firebase Cloud Messaging \n\n Notification! Oh yes, you actually can receive push notification on web app. Also, Firebase Cloud Messaging (FCM) is super easy to setup compared to Google Cloud Messaging (GCM). FCM is the new version of GCM, but the configuration for FCM is simple, you no longer have to write your own logic. And it works on everywhere, from web to Android and iOS. \n\n # Other small (and big?) stuffs that make Firebase super awesome \n\n There’re some really useful tools that make Firebase super awesome: \n\n ## Firebase CLI \n\n Probably this is one of the most important tools for me. Firebase CLI is a command line tools for you to: Deploy code to Firebase, Run a local web server for Firebase Hosting, Run a local server for Cloud Functions, and more … \n\n ## Polymerfire \n\n If you are using (or plan to use) Polymer/Web Components with Firebase, then you need to make sure you are using Polymerfire. Polymerfire is a web component built using Polymer for Firebase. This component allows me to use Firebase (Authentication and Realtime Database) “without” writing a lot of JavaScripts. \n\n ## Community and the Firebase Team \n\n Google is working very hard to make Firebase super awesome. \n\n **Conferences/Events** - Firebase is always a big thing in Google I/O for the last few years. And there’s a Firebase conference: Firebase Dev Summit going to happen on Halloween this year, 31st October 2017. \n\n **Firecasts** - **Firecasts** is a YouTube series of Firebase Screencasts featuring the super famous David East and other engineers from Firebase. \n\n **Firebase Slack** - Questions? No Problem! The Firebase Slack community is the best place for you to learn, discussing or ask questions anything about Firebase. And don’t worry, Firebase Google Developer Experts, members from Firebase team and others are always ready to help you. \n\n **Stack Overflow and Twitter (#AskFirebase)** - As always, you can ask or find questions and solutions on developer’s heaven: Stack Overflow. And Firebase team is super active on Twitter, just put #AskFirebase in your tweet, and the team might answer your question :) \n\n # Firebae? Firebase is built for lazy developer? 💁🏻 \n\n To be honest, Firebase is super useful during Hackathon, since you can “setup” your database and hosting and few seconds (setup = create and initialize project, that’s it). So you can spend those precious time to prepare on how to pitch your idea, or … sleep. \n\n Also, I built a Progressive Web Apps using Polymer and Firebase for Google I/O Extended 2017 Kuala Lumpur. You can [read more here](https://medium.com/@limhenry/case-study-the-google-i-o-extended-2017-kuala-lumpur-progressive-web-app-a786e82984d7). \n\n In fact, I use most of the Firebase features for that progressive web app: Firebase Realtime Database, Firebase Authentication, Firebase Hosting, Cloud Storage for Firebase and Cloud Functions for Firebase. Thanks to Firebase, I can spend more time on making the site loads faster instead of wasting my time on setting up server and database. \n\n # Fire Fire Fire! You need Fire Extinguisher 🔥🚒 \n\n Firebase is super awesome 🔥 and it’s getting better every day (and [SPOILER] more features are coming soon too!). \n\n You can learn more about Firebase at [firebase.google.com](https://firebase.google.com) and try the Firebase codelabs at [http://g.co/codelabs](g.co/codelabs). \n\n Use Firebase, and make your app great again! 🔥 \n\n\n\n *Or maybe the reasons why I love Firebase so much is because [I won a free Google I/O 2017 ticket from Firebass challenge](https://www.digitalnewsasia.com/mobility/student-nets-elusive-firebass-ticket-google%E2%80%99s-io-2017) ( ͡° ͜ʖ ͡°) and also … I won the Best Progressive Web App Award from Firebase’s Static Showdown 2016 Hackathon. Thanks Michael and the Firebase team!*"
}